bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G431xx.svd
            <register>
               <name>CNDTR2</name>
               <displayName>CNDTR2</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR3</name>
               <displayName>CNDTR3</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR4</name>
               <displayName>CNDTR4</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR5</name>
               <displayName>CNDTR5</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR6</name>
               <displayName>CNDTR6</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR7</name>
               <displayName>CNDTR7</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNDTR8</name>
               <displayName>CNDTR8</displayName>
               <description>channel x number of data to transfer           register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NDT</name>
                     <description>Number of data items to               transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR1</name>
               <displayName>CPAR1</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR2</name>
               <displayName>CPAR2</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR3</name>
               <displayName>CPAR3</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR4</name>
               <displayName>CPAR4</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR5</name>
               <displayName>CPAR5</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR6</name>
               <displayName>CPAR6</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR7</name>
               <displayName>CPAR7</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPAR8</name>
               <displayName>CPAR8</displayName>
               <description>DMA channel x peripheral address           register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PA</name>
                     <description>Peripheral address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR1</name>
               <displayName>CMAR1</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR2</name>
               <displayName>CMAR2</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR3</name>
               <displayName>CMAR3</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR4</name>
               <displayName>CMAR4</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR5</name>
               <displayName>CMAR5</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR6</name>
               <displayName>CMAR6</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR7</name>
               <displayName>CMAR7</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMAR8</name>
               <displayName>CMAR8</displayName>
               <description>DMA channel x memory address           register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MA</name>
                     <description>Memory 1 address (used in case of Double               buffer mode)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
